In [1]:
%pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\asus\desktop\dph02\venv\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython-sql) (8.25.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython-sql) (2.0.30)
Requirement already satisfied: sqlparse in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython-sql) (0.5.0)
Requirement already satisfied: six in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\asus\desktop\dph02\venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\asus\desktop\dph02\venv\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: decorator in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments>=2.4.0 in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\asus\desktop\dph02\venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\asus\desktop\dph02\venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\asus\desktop\dph02\venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\asus\desktop\dph02\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\asus\desktop\dph02\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\asus\desktop\dph02\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Note: you may need to restart the kernel to use updated packages.

# **SQL Methods**
In SQL, methods refer to functions or procedures that perform specific tasks within your queries. They are like pre-defined tools that you can use to manipulate, analyze, or interact with your data in various ways.

## DISTINCT
The **DISTINCT** keyword is used to return only distinct (unique) values in the result set of a query. It ensures that duplicate **rows** are removed from the output.

#### Syntax:
```
 %%sql
SELECT DISTINCT column1, column2, ...
FROM table_name;

In [7]:
%%sql
SELECT DISTINCT department
FROM Students;

 * sqlite:///sql-methods-database.db
Done.

[('Animation',),
 ('Marketing',),
 ('Sales',),
 ('IT',),
 ('Business',),
 ('Accountancy',),
 ('Engineering',)]

## LIMIT
The **LIMIT** clause specifies the maximum number of rows to return in a query result.
#### Syntax
```
%%sql
SELECT * FROM table_name
LIMIT number_of_rows;
```

In [8]:
%%sql
SELECT * FROM Students
LIMIT 5;

 * sqlite:///sql-methods-database.db
Done.

[(101, 'Richard', 'Davis', 'Animation', 90.8),
 (102, 'Linda', 'Clark', 'Marketing', 75.4),
 (103, 'Joseph', 'Lewis', 'Sales', 98),
 (104, 'Elizabeth', 'Walker', 'IT', 76.8),
 (105, 'William', 'Lopez', 'Business', 95)]

##### LIMIT (offset, number_of_rows)

In [9]:
%%sql
SELECT * FROM Students
LIMIT 3, 5;

 * sqlite:///sql-methods-database.db
Done.

[(104, 'Elizabeth', 'Walker', 'IT', 76.8),
 (105, 'William', 'Lopez', 'Business', 95),
 (106, 'Barbara', 'Thompson', 'Accountancy', 85),
 (107, 'Susan', 'Martin', 'Marketing', 95),
 (108, 'Kenneth', 'Lee', 'IT', 88.3)]

## COUNT
The **COUNT** function is used to count the number of rows in a table or the number of rows matching a specific condition.

#### Syntax:
```
%%sql

SELECT COUNT(*) FROM table_name
SELECT COUNT(column_name) FROM table_name
SELECT COUNT(DISTINCT column_name) FROM table_name;
```

In [12]:
%%sql

-- Return the total number of rows in the students table

-- Return the total number of rows of a specific column
SELECT COUNT(first_name) FROM Students;

-- Return the total number of unique values in a specific column
SELECT COUNT(DISTINCT department) FROM Students;

 * sqlite:///sql-methods-database.db
Done.
Done.

[(7,)]

## WHERE
The **WHERE** clause is used to filter data retrieved from a database based on specific conditions.
> **Common Operators Used in WHERE Clause:**
```
Comparison Operators:
  [ = ] , [ != ] , [ < ] , [ > ] , [ <= ] , [ >= ]
Logical Operators:
  AND , OR , NOT
Special Operators:
  BETWEEN , IN , LIKE

#### Syntax 1: 
For Simple Comparison Operators:
```
%%sql
SELECT *
FROM table_name
WHERE condition;
```

In [14]:
%%sql
-- using the equal to [ = ]
SELECT * FROM Students
WHERE grade = 95;
-- using the not equal to [ != ]
SELECT * FROM Students
WHERE department != "IT"; 
-- using the less than [ < ]
SELECT * FROM Students
WHERE grade < 80;
-- using the greater than [ > ]
SELECT * FROM Students
WHERE grade > 90;
-- using the less than or equal to [ <= ]
SELECT * FROM Students
WHERE grade <= 85;
-- using the greater than or equal to [ >= ]
SELECT * FROM Students
WHERE grade >= 88;

 * sqlite:///sql-methods-database.db
Done.
Done.
Done.
Done.
Done.
Done.

[(101, 'Richard', 'Davis', 'Animation', 90.8),
 (103, 'Joseph', 'Lewis', 'Sales', 98),
 (105, 'William', 'Lopez', 'Business', 95),
 (107, 'Susan', 'Martin', 'Marketing', 95),
 (108, 'Kenneth', 'Lee', 'IT', 88.3),
 (110, 'Steven', 'Jackson', 'Business', 88.3)]

#### Syntax 2:
For Logical Operators:
```
%%sql
SELECT column1, column2, ...
FROM table_name
WHERE condition1 AND/OR/NOT condition2;
```

In [15]:
%%sql
-- Logical AND - both conditions must be TRUE
SELECT * FROM Students
WHERE department = "IT" AND grade > 85;
-- Logical OR - at lease one of the conditions is TRUE
SELECT * FROM Students
WHERE department = "Marketing" OR department = "IT";
-- Logical NOT - negates the result
SELECT * FROM Students
WHERE NOT department = "Animation";

 * sqlite:///sql-methods-database.db
Done.
Done.
Done.

[(102, 'Linda', 'Clark', 'Marketing', 75.4),
 (103, 'Joseph', 'Lewis', 'Sales', 98),
 (104, 'Elizabeth', 'Walker', 'IT', 76.8),
 (105, 'William', 'Lopez', 'Business', 95),
 (106, 'Barbara', 'Thompson', 'Accountancy', 85),
 (107, 'Susan', 'Martin', 'Marketing', 95),
 (108, 'Kenneth', 'Lee', 'IT', 88.3),
 (109, 'Amanda', 'White', 'Engineering', 85),
 (110, 'Steven', 'Jackson', 'Business', 88.3)]

#### Syntax 3:
For Special Operators:
```
%%sql
-- BETWEEN
SELECT column1, column2, ... FROM table_name
WHERE column_name BETWEEN value1 AND value2;
-- IN
SELECT column1, column2, ... FROM table_name
WHERE column_name IN (value1, value2, ...);
-- LIKE
SELECT column1, column2, ... FROM table_name
WHERE column_name LIKE pattern;
```

In [16]:
%%sql
-- BETWEEN (range) - inclusive
SELECT * FROM Students
WHERE grade BETWEEN 80 AND 95;
-- IN
SELECT * FROM Students
WHERE department IN ("Animation", "Business"); 
-- LIKE [ % - matches any sequence of characters ; _ - matches a single character]
-- ending substring
SELECT * FROM Students
WHERE first_name LIKE '%ard';
-- starting substring
SELECT * FROM Students
WHERE first_name LIKE 'S%';
-- contain
SELECT * FROM Students
WHERE first_name LIKE '%a%';
-- character position [ _ will be characters of the string]
SELECT * FROM Students
WHERE first_name LIKE '_o%';

 * sqlite:///sql-methods-database.db
Done.
Done.
Done.
Done.
Done.
Done.

[(103, 'Joseph', 'Lewis', 'Sales', 98)]

In [17]:
%%sql 
SELECT * FROM Students
WHERE (department = "Marketing" AND grade > 80) 
    OR (department = "IT" AND grade > 85);

 * sqlite:///sql-methods-database.db
Done.

[(107, 'Susan', 'Martin', 'Marketing', 95),
 (108, 'Kenneth', 'Lee', 'IT', 88.3)]

Combined Operators

In [18]:
%%sql
SELECT * FROM Students
WHERE NOT department = "Sales"
    AND (grade > 90 OR department = "Business");

 * sqlite:///sql-methods-database.db
Done.

[(101, 'Richard', 'Davis', 'Animation', 90.8),
 (105, 'William', 'Lopez', 'Business', 95),
 (107, 'Susan', 'Martin', 'Marketing', 95),
 (110, 'Steven', 'Jackson', 'Business', 88.3)]

In [19]:
%%sql 
SELECT * FROM Students
WHERE grade BETWEEN 80 AND 90
    AND department IN ("IT", "Business", "Animation")
    AND first_name LIKE '%e%';

 * sqlite:///sql-methods-database.db
Done.

[(108, 'Kenneth', 'Lee', 'IT', 88.3),
 (110, 'Steven', 'Jackson', 'Business', 88.3)]

---

## ORDER BY
The **ORDER BY** clause allows you to sort the results of your SELECT queries in either ascending or descending order. It lets you sort the retrieved data based on one or more columns, making it easier to analyze and interpret.

    * **ASC:** Ascending Order (default)
    * **DESC:** Descending Order
      
#### Syntax:
```
%%sql
SELECT column1, column2, ...
FROM table_name
ORDER BY column_name1 ASC/DESC, column_name2 ASC/DESC, ... ;
```

In [20]:
%%sql
-- Sorting a Single Column
SELECT * FROM Students
ORDER BY last_name ASC;
-- Sorting Multiple Columns
SELECT * FROM Students
ORDER BY department ASC, grade DESC;
-- Sorting by Expressions
SELECT * FROM Students
WHERE (grade < 95) ORDER BY grade DESC;
-- Sorting by Position
SELECT * FROM Students
ORDER BY 4 DESC;
-- Sorting in Random Order
SELECT * FROM Students
ORDER BY RANDOM();

 * sqlite:///sql-methods-database.db
Done.
Done.
Done.
Done.
Done.

[(102, 'Linda', 'Clark', 'Marketing', 75.4),
 (105, 'William', 'Lopez', 'Business', 95),
 (110, 'Steven', 'Jackson', 'Business', 88.3),
 (108, 'Kenneth', 'Lee', 'IT', 88.3),
 (103, 'Joseph', 'Lewis', 'Sales', 98),
 (106, 'Barbara', 'Thompson', 'Accountancy', 85),
 (101, 'Richard', 'Davis', 'Animation', 90.8),
 (109, 'Amanda', 'White', 'Engineering', 85),
 (104, 'Elizabeth', 'Walker', 'IT', 76.8),
 (107, 'Susan', 'Martin', 'Marketing', 95)]

In [21]:
%%sql
-- Return the Top 3 students with highest grades
SELECT * FROM Students
ORDER BY grade DESC
LIMIT 3

 * sqlite:///sql-methods-database.db
Done.

[(103, 'Joseph', 'Lewis', 'Sales', 98),
 (105, 'William', 'Lopez', 'Business', 95),
 (107, 'Susan', 'Martin', 'Marketing', 95)]

---

## GROUP BY

The **GROUP BY** clause is used to organize and summarize data by grouping rows with the same values in one or more columns. This helps you analyze trends, patterns, and aggregate statistics within your data.

> Common Aggregate Functions:
``` 
COUNT() , SUM() , AVG() , MAX() , MIN()
```

#### Syntax:
```
%%sql
SELECT column1, column2, ..., aggregate_function(column_or_expression) AS alias
FROM table_name
WHERE condition (optional)
GROUP BY column1, column2, ...;
```

In [22]:
%%sql
-- Grouping with COUNT()
SELECT department, COUNT(*) as student_count
FROM Students
GROUP BY department;
-- Grouping with SUM()
SELECT department, SUM(grade) as total_grades
FROM Students
GROUP BY department;
-- Grouping with AVG()
SELECT department, AVG(grade) as average_grades
FROM Students
GROUP BY department;
-- Grouping with MAX() and MIN()
SELECT department,
    MAX(grade) AS Highest_grade,
    MIN(grade) AS Lowest_grade
FROM Students
GROUP BY department;

 * sqlite:///sql-methods-database.db
Done.
Done.
Done.
Done.

[('Accountancy', 85, 85),
 ('Animation', 90.8, 90.8),
 ('Business', 95, 88.3),
 ('Engineering', 85, 85),
 ('IT', 88.3, 76.8),
 ('Marketing', 95, 75.4),
 ('Sales', 98, 98)]

---

## HAVING
The **HAVING** clause is used to filter groups of rows created by the GROUP BY clause based on conditions applied to aggregate functions. This allows you to focus on specific groups that meet certain criteria within your summarized data.
##### Syntax:
```
%%sql
SELECT column1, aggregate_function(column2), ...
FROM table_name
WHERE condition (optional)
GROUP BY column_name1, column_name2, ...
HAVING condition_on_aggregate_function;
```

In [24]:
%%sql

SELECT department, AVG(grade) AS Average_grade
FROM Students
GROUP BY department
HAVING AVG(grade) > 85;

SELECT department, AVG(grade) AS Average_grade
FROM Students
GROUP BY department
HAVING COUNT(*) <= 5 AND AVG(grade) > 95;

 * sqlite:///sql-methods-database.db
Done.
Done.

[('Sales', 98.0)]

## JOIN
The JOIN clause is used to combine rows from two or more tables based on a related column between them. It allows you to retrieve data from multiple tables simultaneously, creating a single result set.

> **Types of Joins:**
```
Inner Join
Left Join
Right Join
Full Join
```
##### Syntax:
```
%%sql
SELECT column1_from_table1, column2_from_table2, ...
FROM table1
JOIN table2 ON table1.join_column = table2.join_column;
```

---

In [25]:
%%sql 
CREATE TABLE IF NOT EXISTS departments (
    department_id INT PRIMARY KEY
);

 * sqlite:///sql-methods-database.db
Done.

[]

In [26]:
%%sql 
ALTER TABLE departments 
ADD department_name VARCHAR(50);

 * sqlite:///sql-methods-database.db
Done.

[]

In [27]:
%%sql
INSERT INTO departments (department_id, department_name) 
VALUES (1, 'Accountancy'),
    (2, 'Marketing'),
    (3, 'Sales'),
    (4, 'IT'),
    (5, 'Animation'),
    (6, 'Finance'),
    (7, 'Business'),
    (8, 'Engineering');

 * sqlite:///sql-methods-database.db
8 rows affected.

[]

In [28]:
%%sql
INSERT INTO departments (department_id, department_name) 
VALUES (9, 'Social Services');

 * sqlite:///sql-methods-database.db
1 rows affected.

[]

In [29]:
%sql SELECT * FROM departments;

 * sqlite:///sql-methods-database.db
Done.

[(1, 'Accountancy'),
 (2, 'Marketing'),
 (3, 'Sales'),
 (4, 'IT'),
 (5, 'Animation'),
 (6, 'Finance'),
 (7, 'Business'),
 (8, 'Engineering'),
 (9, 'Social Services')]

In [30]:
%%sql
INSERT INTO Students (student_id, first_name, last_name, department, grade)
VALUES (112, 'Meynard', 'Melo', NULL, 89);

 * sqlite:///sql-methods-database.db
1 rows affected.

[]

In [33]:
%sql SELECT * FROM Students;

 * sqlite:///sql-methods-database.db
Done.

[(101, 'Richard', 'Davis', 'Animation', 90.8),
 (102, 'Linda', 'Clark', 'Marketing', 75.4),
 (103, 'Joseph', 'Lewis', 'Sales', 98),
 (104, 'Elizabeth', 'Walker', 'IT', 76.8),
 (105, 'William', 'Lopez', 'Business', 95),
 (106, 'Barbara', 'Thompson', 'Accountancy', 85),
 (107, 'Susan', 'Martin', 'Marketing', 95),
 (108, 'Kenneth', 'Lee', 'IT', 88.3),
 (109, 'Amanda', 'White', 'Engineering', 85),
 (110, 'Steven', 'Jackson', 'Business', 88.3),
 (112, 'Meynard', 'Melo', None, 89)]

### Inner Join
The INNER JOIN returns rows where there is a match in both tables

In [32]:
%%sql
SELECT student_id, first_name, last_name, department_name
FROM Students
INNER JOIN departments ON Students.department = departments.department_name;

 * sqlite:///sql-methods-database.db
Done.

[(101, 'Richard', 'Davis', 'Animation'),
 (102, 'Linda', 'Clark', 'Marketing'),
 (103, 'Joseph', 'Lewis', 'Sales'),
 (104, 'Elizabeth', 'Walker', 'IT'),
 (105, 'William', 'Lopez', 'Business'),
 (106, 'Barbara', 'Thompson', 'Accountancy'),
 (107, 'Susan', 'Martin', 'Marketing'),
 (108, 'Kenneth', 'Lee', 'IT'),
 (109, 'Amanda', 'White', 'Engineering'),
 (110, 'Steven', 'Jackson', 'Business')]

### Left Join
Returns all rows from the left table and the matched rows from the right table. If there's no match, NULL values are filled in for columns from the right table.

In [35]:
%%sql

-- Gets all table A,  
SELECT s.student_id, s.first_name, s.last_name, d.department_name
FROM Students s
LEFT JOIN departments d ON s.department = d.department_name;

 * sqlite:///sql-methods-database.db
Done.

[(101, 'Richard', 'Davis', 'Animation'),
 (102, 'Linda', 'Clark', 'Marketing'),
 (103, 'Joseph', 'Lewis', 'Sales'),
 (104, 'Elizabeth', 'Walker', 'IT'),
 (105, 'William', 'Lopez', 'Business'),
 (106, 'Barbara', 'Thompson', 'Accountancy'),
 (107, 'Susan', 'Martin', 'Marketing'),
 (108, 'Kenneth', 'Lee', 'IT'),
 (109, 'Amanda', 'White', 'Engineering'),
 (110, 'Steven', 'Jackson', 'Business'),
 (112, 'Meynard', 'Melo', None)]

### Right Join
This query will return all departments from the Departments table, even if there are no students currently enrolled in them. Unmatched students will have NULL values in the student columns.

In [36]:
%%sql 
SELECT s.student_id, s.first_name, s.last_name, d.department_name
FROM Students s
RIGHT JOIN departments d ON s.department = d.department_name;

 * sqlite:///sql-methods-database.db
Done.

[(101, 'Richard', 'Davis', 'Animation'),
 (102, 'Linda', 'Clark', 'Marketing'),
 (103, 'Joseph', 'Lewis', 'Sales'),
 (104, 'Elizabeth', 'Walker', 'IT'),
 (105, 'William', 'Lopez', 'Business'),
 (106, 'Barbara', 'Thompson', 'Accountancy'),
 (107, 'Susan', 'Martin', 'Marketing'),
 (108, 'Kenneth', 'Lee', 'IT'),
 (109, 'Amanda', 'White', 'Engineering'),
 (110, 'Steven', 'Jackson', 'Business'),
 (None, None, None, 'Finance'),
 (None, None, None, 'Social Services')]

### FULL JOIN
This query will return all records from both tables, regardless of whether there's a match in the join condition. Unmatched departments or students will have NULL values in the corresponding columns.

In [37]:
%%sql
SELECT s.student_id, s.first_name, s.last_name, d.department_name
FROM Students s
FULL JOIN departments d ON s.department = d.department_name;

 * sqlite:///sql-methods-database.db
Done.

[(101, 'Richard', 'Davis', 'Animation'),
 (102, 'Linda', 'Clark', 'Marketing'),
 (103, 'Joseph', 'Lewis', 'Sales'),
 (104, 'Elizabeth', 'Walker', 'IT'),
 (105, 'William', 'Lopez', 'Business'),
 (106, 'Barbara', 'Thompson', 'Accountancy'),
 (107, 'Susan', 'Martin', 'Marketing'),
 (108, 'Kenneth', 'Lee', 'IT'),
 (109, 'Amanda', 'White', 'Engineering'),
 (110, 'Steven', 'Jackson', 'Business'),
 (112, 'Meynard', 'Melo', None),
 (None, None, None, 'Finance'),
 (None, None, None, 'Social Services')]

---

## CASE ... WHEN

The **CASE...WHEN** statement allows you to conditionally assign values to a column based on specific criteria. It's like creating an if-else logic within your SQL query.

##### Syntax:
```
%%sql
SELECT
  CASE WHEN condition1 THEN value1
       WHEN condition2 THEN value2
       ...
       ELSE value_else
  END AS new_column_name
FROM table_name;
```

In [39]:
%%sql 
SELECT student_id, first_name, last_name, grade,
    CASE
        WHEN grade >= 90 THEN 'Excellent'
        WHEN grade >= 80 AND grade < 90 THEN 'Good'
        WHEN grade >= 70 AND grade < 80 THEN 'Average'
        ELSE 'Needs Improvement'
    END AS grade_category
FROM Students

 * sqlite:///sql-methods-database.db
Done.

[(101, 'Richard', 'Davis', 90.8, 'Excellent'),
 (102, 'Linda', 'Clark', 75.4, 'Average'),
 (103, 'Joseph', 'Lewis', 98, 'Excellent'),
 (104, 'Elizabeth', 'Walker', 76.8, 'Average'),
 (105, 'William', 'Lopez', 95, 'Excellent'),
 (106, 'Barbara', 'Thompson', 85, 'Good'),
 (107, 'Susan', 'Martin', 95, 'Excellent'),
 (108, 'Kenneth', 'Lee', 88.3, 'Good'),
 (109, 'Amanda', 'White', 85, 'Good'),
 (110, 'Steven', 'Jackson', 88.3, 'Good'),
 (112, 'Meynard', 'Melo', 89, 'Good')]

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///sql-methods-database.db

In [4]:
%%sql
CREATE TABLE IF NOT EXISTS Students (
    student_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    grade DECIMAL(3, 2) NOT NULL
);

 * sqlite:///sql-methods-database.db
Done.

[]

In [5]:
%%sql
INSERT INTO Students (student_id, first_name, last_name, department, grade) 
VALUES (101, 'Richard', 'Davis', 'Animation', 90.8),
        (102, 'Linda', 'Clark', 'Marketing', 75.4),
        (103, 'Joseph', 'Lewis', 'Sales', 98),
        (104, 'Elizabeth', 'Walker', 'IT', 76.8),
        (105, 'William', 'Lopez', 'Business', 95),
        (106, 'Barbara', 'Thompson', 'Accountancy', 85),
        (107, 'Susan', 'Martin', 'Marketing', 95),
        (108, 'Kenneth', 'Lee', 'IT', 88.3),
        (109, 'Amanda', 'White', 'Engineering', 85),
        (110, 'Steven', 'Jackson', 'Business', 88.3);

 * sqlite:///sql-methods-database.db
10 rows affected.

[]

In [6]:
%sql SELECT * FROM Students;

 * sqlite:///sql-methods-database.db
Done.

[(101, 'Richard', 'Davis', 'Animation', 90.8),
 (102, 'Linda', 'Clark', 'Marketing', 75.4),
 (103, 'Joseph', 'Lewis', 'Sales', 98),
 (104, 'Elizabeth', 'Walker', 'IT', 76.8),
 (105, 'William', 'Lopez', 'Business', 95),
 (106, 'Barbara', 'Thompson', 'Accountancy', 85),
 (107, 'Susan', 'Martin', 'Marketing', 95),
 (108, 'Kenneth', 'Lee', 'IT', 88.3),
 (109, 'Amanda', 'White', 'Engineering', 85),
 (110, 'Steven', 'Jackson', 'Business', 88.3)]